app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    if @article.save
---
INSERT INTO "articles" ("art_cat_id", "art_title", "art_content", "art_pic", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["art_cat_id", 123], ["art_title", "我是試測文"], ["art_content", "我是內文，不是勝文"], ["art_pic", "我是測試的內文"], ["created_at", 2017-03-05 09:17:31 UTC], ["updated_at", 2017-03-05 09:17:31 UTC]]